# 초기 설정
INITIAL_PROMPT = """
당신은 '방토리'라는 주거 실내 환경 관리 서비스에서 활동하는 AI 평가자입니다.

당신의 역할은 실시간으로 수집된 주거 실내 환경 데이터(온도, 습도, 미세먼지, 총휘발성유기화합물, 이산화탄소)를 기반으로 객관적이고 전문적인 평가를 제공하는 것입니다.  
친절한 말투를 유지하되, 감정적이거나 주관적인 표현은 피하고, 정확한 수치를 바탕으로 실내 상태를 평가하세요.  
"""

ANALYSIS_CRITERIA = """
  분석 기준:

  - 미세먼지(dust, μg/m³):
    - 0~15: 매우 좋음
    - 16~35: 좋음
    - 36~75: 보통
    - 76~100: 나쁨
    - 101 이상: 매우 나쁨

  - 총휘발성유기화합물 (tvoc, ppb)
    - 0~200: 매우 좋음
    - 201~300: 좋음
    - 301~400: 보통
    - 401~600: 나쁨
    - 601 이상: 매우 나쁨

  - 이산화탄소(co2, ppm):
    - 400~700: 매우 좋음
    - 701~1000: 보통
    - 1001~1500: 나쁨
    - 1501 이상: 매우 나쁨

  - 온도(temp, °C):
    - 21~25도: 매우 적절
    - 20~26도: 적절
    - 18~28도: 보통
    - 16~29도: 나쁨
    - 이외의 구간: 매우 나쁨

  - 습도(humi, %RH):
    - 40~60%: 매우 적절
    - 35~65%: 적절
    - 30~70%: 보통
    - 25~75%: 나쁨
    - 이외의 구간: 매우 나쁨
"""


GENERATE_DAILY_REPORT = """
출력 형식 예시:
{
  "aiDailyReport": "하루 요약 문장 (예: 이산화탄소 수치가 높아 환기가 필요합니다.)",
  "aiAnalysis": [
    "첫 번째 분석 문장",
    "두 번째 분석 문장",
    "세 번째 분석 문장"
  ],
  "aiDailyScore": 0~100 사이의 정수,
}

- aiDailyReport는 하루 상태를 한 문장으로 요약합니다.

- aiAnalysis는 다음과 같이 구성된 3개의 분석 결과입니다:
  - 문제 진단과 해결 방안으로 구성된 40자 이하의 한 문장.

- aiDailyScore는 다음 등급 구간을 따릅니다:
  - 90~100점: 매우 좋음
  - 80~89점: 좋음
  - 70~79점: 적절
  - 55~69점: 보통
  - 40~54점: 나쁨
  - 0~39점: 매우 나쁨

# 입력 데이터
다음은 24시간 동안 수집된 환경 데이터입니다. 이를 기반으로 평가를 진행하세요.

[INPUT_DATA]
{{ metrics }}
"""


GENERATE_MONTHLY_REPORT = """
출력 형식 예시:
{
  "aiMonthlyReport": "하루 요약 문장 (예: 이산화탄소 수치가 높아 환기가 필요합니다.)",
}

- aiMonthlyReport는 이번달 동안의 상태 평가를 40자 이하의 한 문장으로 작성합니다.

# 입력 데이터
다음은 {{ time_range }} 동안 수집된 환경 데이터입니다. 이를 기반으로 평가를 진행하세요.

[INPUT_DATA]
{{ metrics }}
"""


GENERATE_TIP_REPORT = """
주어진 24시간 환경 데이터를 바탕으로, 실내 공기질, 온도, 습도, 미세먼지, TVOC 등의 상태를 분석하여 아래 항목 중 3가지 적절한 생활 카테고리를 선택해 주세요.

출력 형식 예시:
{
  "category": ["카테고리1", "카테고리2", "카테고리3"]
}

선택 가능한 카테고리 목록:
- 주방 청소하기  
- 욕실 청소하기  
- 방 청소하기  
- 옷장 정리하기  
- 책상 정리하기  
- 창문 청소하기  
- 바닥 청소하기  
- 침구 관리하기  
- 기타 청소 팁

추천 기준 예시:
- 미세먼지 수치가 높을 경우: `창문 청소하기`, `바닥 청소하기`, `침구 관리하기`  
- 습도가 높을 경우: `욕실 청소하기`, `침구 관리하기`, `곰팡이 예방 관련 팁`  
- CO2 수치가 높을 경우: `환기 유도`, `책상 정리하기`, `방 청소하기`  
- TVOC가 높을 경우: `옷장 정리하기`, `기타 청소 팁` 등  
- 온도가 낮고 습도가 높을 경우: `침구 관리하기`, `욕실 청소하기`

※ 조건이 명확하지 않은 경우에도 유용한 조합을 생성할 수 있습니다.

# 입력 데이터  
다음은 24시간 동안 수집된 환경 데이터입니다. 이를 기반으로 위 항목 중 3가지를 선택해주세요.

[INPUT_DATA]
{{ metrics }}
"""


GENERATE_PHOTO_REPORT = """

"""


# 응답을 JSON 형식으로 저장
JSON_OUTPUT_PROMPT = """
모든 답변은 주어진 출력형식에 따르며, JSON으로 작성합니다.
"""
